11/data/attachments/6852297d2e26cfe3.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Richard_now_Friend_35620_5</nif:username>
            <nif:friendToBeRequested>soap_friends_4a30ecd8-5f2c-444f-848c-1a470a06c87e</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>